GopalSaraf/Practicals/PSDL/include/proc/pic16f18324.inc
// Register: PWMTMRS
#define PWMTMRS PWMTMRS
PWMTMRS                                  equ 061Fh
// bitfield definitions
PWMTMRS_P5TSEL_POSN                      equ 0000h
PWMTMRS_P5TSEL_POSITION                  equ 0000h
PWMTMRS_P5TSEL_SIZE                      equ 0002h
PWMTMRS_P5TSEL_LENGTH                    equ 0002h
PWMTMRS_P5TSEL_MASK                      equ 0003h
PWMTMRS_P6TSEL_POSN                      equ 0002h
PWMTMRS_P6TSEL_POSITION                  equ 0002h
PWMTMRS_P6TSEL_SIZE                      equ 0002h
PWMTMRS_P6TSEL_LENGTH                    equ 0002h
PWMTMRS_P6TSEL_MASK                      equ 000Ch
PWMTMRS_P5TSEL0_POSN                     equ 0000h
PWMTMRS_P5TSEL0_POSITION                 equ 0000h
PWMTMRS_P5TSEL0_SIZE                     equ 0001h
PWMTMRS_P5TSEL0_LENGTH                   equ 0001h
PWMTMRS_P5TSEL0_MASK                     equ 0001h
PWMTMRS_P5TSEL1_POSN                     equ 0001h
PWMTMRS_P5TSEL1_POSITION                 equ 0001h
PWMTMRS_P5TSEL1_SIZE                     equ 0001h
PWMTMRS_P5TSEL1_LENGTH                   equ 0001h
PWMTMRS_P5TSEL1_MASK                     equ 0002h
PWMTMRS_P6TSEL0_POSN                     equ 0002h
PWMTMRS_P6TSEL0_POSITION                 equ 0002h
PWMTMRS_P6TSEL0_SIZE                     equ 0001h
PWMTMRS_P6TSEL0_LENGTH                   equ 0001h
PWMTMRS_P6TSEL0_MASK                     equ 0004h
PWMTMRS_P6TSEL1_POSN                     equ 0003h
PWMTMRS_P6TSEL1_POSITION                 equ 0003h
PWMTMRS_P6TSEL1_SIZE                     equ 0001h
PWMTMRS_P6TSEL1_LENGTH                   equ 0001h
PWMTMRS_P6TSEL1_MASK                     equ 0008h

// Register: CWG1CLKCON
#define CWG1CLKCON CWG1CLKCON
CWG1CLKCON                               equ 0691h
// bitfield definitions
CWG1CLKCON_CS_POSN                       equ 0000h
CWG1CLKCON_CS_POSITION                   equ 0000h
CWG1CLKCON_CS_SIZE                       equ 0001h
CWG1CLKCON_CS_LENGTH                     equ 0001h
CWG1CLKCON_CS_MASK                       equ 0001h
CWG1CLKCON_CWG1CS_POSN                   equ 0000h
CWG1CLKCON_CWG1CS_POSITION               equ 0000h
CWG1CLKCON_CWG1CS_SIZE                   equ 0001h
CWG1CLKCON_CWG1CS_LENGTH                 equ 0001h
CWG1CLKCON_CWG1CS_MASK                   equ 0001h

// Register: CWG1DAT
#define CWG1DAT CWG1DAT
CWG1DAT                                  equ 0692h
// bitfield definitions
CWG1DAT_DAT_POSN                         equ 0000h
CWG1DAT_DAT_POSITION                     equ 0000h
CWG1DAT_DAT_SIZE                         equ 0004h
CWG1DAT_DAT_LENGTH                       equ 0004h
CWG1DAT_DAT_MASK                         equ 000Fh
CWG1DAT_CWG1DAT0_POSN                    equ 0000h
CWG1DAT_CWG1DAT0_POSITION                equ 0000h
CWG1DAT_CWG1DAT0_SIZE                    equ 0001h
CWG1DAT_CWG1DAT0_LENGTH                  equ 0001h
CWG1DAT_CWG1DAT0_MASK                    equ 0001h
CWG1DAT_CWG1DAT1_POSN                    equ 0001h
CWG1DAT_CWG1DAT1_POSITION                equ 0001h
CWG1DAT_CWG1DAT1_SIZE                    equ 0001h
CWG1DAT_CWG1DAT1_LENGTH                  equ 0001h
CWG1DAT_CWG1DAT1_MASK                    equ 0002h
CWG1DAT_CWG1DAT2_POSN                    equ 0002h
CWG1DAT_CWG1DAT2_POSITION                equ 0002h
CWG1DAT_CWG1DAT2_SIZE                    equ 0001h
CWG1DAT_CWG1DAT2_LENGTH                  equ 0001h
CWG1DAT_CWG1DAT2_MASK                    equ 0004h
CWG1DAT_CWG1DAT3_POSN                    equ 0003h
CWG1DAT_CWG1DAT3_POSITION                equ 0003h
CWG1DAT_CWG1DAT3_SIZE                    equ 0001h
CWG1DAT_CWG1DAT3_LENGTH                  equ 0001h
CWG1DAT_CWG1DAT3_MASK                    equ 0008h

// Register: CWG1DBR
#define CWG1DBR CWG1DBR
CWG1DBR                                  equ 0693h
// bitfield definitions
CWG1DBR_DBR_POSN                         equ 0000h
CWG1DBR_DBR_POSITION                     equ 0000h
CWG1DBR_DBR_SIZE                         equ 0006h
CWG1DBR_DBR_LENGTH                       equ 0006h
CWG1DBR_DBR_MASK                         equ 003Fh
CWG1DBR_DBR0_POSN                        equ 0000h
CWG1DBR_DBR0_POSITION                    equ 0000h
CWG1DBR_DBR0_SIZE                        equ 0001h
CWG1DBR_DBR0_LENGTH                      equ 0001h
CWG1DBR_DBR0_MASK                        equ 0001h
CWG1DBR_DBR1_POSN                        equ 0001h
CWG1DBR_DBR1_POSITION                    equ 0001h
CWG1DBR_DBR1_SIZE                        equ 0001h
CWG1DBR_DBR1_LENGTH                      equ 0001h
CWG1DBR_DBR1_MASK                        equ 0002h
CWG1DBR_DBR2_POSN                        equ 0002h
CWG1DBR_DBR2_POSITION                    equ 0002h
CWG1DBR_DBR2_SIZE                        equ 0001h
CWG1DBR_DBR2_LENGTH                      equ 0001h
CWG1DBR_DBR2_MASK                        equ 0004h
CWG1DBR_DBR3_POSN                        equ 0003h
CWG1DBR_DBR3_POSITION                    equ 0003h
CWG1DBR_DBR3_SIZE                        equ 0001h
CWG1DBR_DBR3_LENGTH                      equ 0001h
CWG1DBR_DBR3_MASK                        equ 0008h
CWG1DBR_DBR4_POSN                        equ 0004h
CWG1DBR_DBR4_POSITION                    equ 0004h
CWG1DBR_DBR4_SIZE                        equ 0001h
CWG1DBR_DBR4_LENGTH                      equ 0001h
CWG1DBR_DBR4_MASK                        equ 0010h
CWG1DBR_DBR5_POSN                        equ 0005h
CWG1DBR_DBR5_POSITION                    equ 0005h
CWG1DBR_DBR5_SIZE                        equ 0001h
CWG1DBR_DBR5_LENGTH                      equ 0001h
CWG1DBR_DBR5_MASK                        equ 0020h
CWG1DBR_CWG1DBR_POSN                     equ 0000h
CWG1DBR_CWG1DBR_POSITION                 equ 0000h
CWG1DBR_CWG1DBR_SIZE                     equ 0006h
CWG1DBR_CWG1DBR_LENGTH                   equ 0006h
CWG1DBR_CWG1DBR_MASK                     equ 003Fh
CWG1DBR_CWG1DBR0_POSN                    equ 0000h
CWG1DBR_CWG1DBR0_POSITION                equ 0000h
CWG1DBR_CWG1DBR0_SIZE                    equ 0001h
CWG1DBR_CWG1DBR0_LENGTH                  equ 0001h
CWG1DBR_CWG1DBR0_MASK                    equ 0001h
CWG1DBR_CWG1DBR1_POSN                    equ 0001h
CWG1DBR_CWG1DBR1_POSITION                equ 0001h
CWG1DBR_CWG1DBR1_SIZE                    equ 0001h
CWG1DBR_CWG1DBR1_LENGTH                  equ 0001h
CWG1DBR_CWG1DBR1_MASK                    equ 0002h
CWG1DBR_CWG1DBR2_POSN                    equ 0002h
CWG1DBR_CWG1DBR2_POSITION                equ 0002h
CWG1DBR_CWG1DBR2_SIZE                    equ 0001h
CWG1DBR_CWG1DBR2_LENGTH                  equ 0001h
CWG1DBR_CWG1DBR2_MASK                    equ 0004h
CWG1DBR_CWG1DBR3_POSN                    equ 0003h
CWG1DBR_CWG1DBR3_POSITION                equ 0003h
CWG1DBR_CWG1DBR3_SIZE                    equ 0001h
CWG1DBR_CWG1DBR3_LENGTH                  equ 0001h
CWG1DBR_CWG1DBR3_MASK                    equ 0008h
CWG1DBR_CWG1DBR4_POSN                    equ 0004h
CWG1DBR_CWG1DBR4_POSITION                equ 0004h
CWG1DBR_CWG1DBR4_SIZE                    equ 0001h
CWG1DBR_CWG1DBR4_LENGTH                  equ 0001h
CWG1DBR_CWG1DBR4_MASK                    equ 0010h
CWG1DBR_CWG1DBR5_POSN                    equ 0005h
CWG1DBR_CWG1DBR5_POSITION                equ 0005h
CWG1DBR_CWG1DBR5_SIZE                    equ 0001h
CWG1DBR_CWG1DBR5_LENGTH                  equ 0001h
CWG1DBR_CWG1DBR5_MASK                    equ 0020h

// Register: CWG1DBF
#define CWG1DBF CWG1DBF
CWG1DBF                                  equ 0694h
// bitfield definitions
CWG1DBF_DBF_POSN                         equ 0000h
CWG1DBF_DBF_POSITION                     equ 0000h
CWG1DBF_DBF_SIZE                         equ 0006h
CWG1DBF_DBF_LENGTH                       equ 0006h
CWG1DBF_DBF_MASK                         equ 003Fh
CWG1DBF_DBF0_POSN                        equ 0000h
CWG1DBF_DBF0_POSITION                    equ 0000h
CWG1DBF_DBF0_SIZE                        equ 0001h
CWG1DBF_DBF0_LENGTH                      equ 0001h
CWG1DBF_DBF0_MASK                        equ 0001h
CWG1DBF_DBF1_POSN                        equ 0001h
CWG1DBF_DBF1_POSITION                    equ 0001h
CWG1DBF_DBF1_SIZE                        equ 0001h
CWG1DBF_DBF1_LENGTH                      equ 0001h
CWG1DBF_DBF1_MASK                        equ 0002h
CWG1DBF_DBF2_POSN                        equ 0002h
CWG1DBF_DBF2_POSITION                    equ 0002h
CWG1DBF_DBF2_SIZE                        equ 0001h
CWG1DBF_DBF2_LENGTH                      equ 0001h
CWG1DBF_DBF2_MASK                        equ 0004h
CWG1DBF_DBF3_POSN                        equ 0003h
CWG1DBF_DBF3_POSITION                    equ 0003h
CWG1DBF_DBF3_SIZE                        equ 0001h
CWG1DBF_DBF3_LENGTH                      equ 0001h
CWG1DBF_DBF3_MASK                        equ 0008h
CWG1DBF_DBF4_POSN                        equ 0004h
CWG1DBF_DBF4_POSITION                    equ 0004h
CWG1DBF_DBF4_SIZE                        equ 0001h
CWG1DBF_DBF4_LENGTH                      equ 0001h
CWG1DBF_DBF4_MASK                        equ 0010h
CWG1DBF_DBF5_POSN                        equ 0005h
CWG1DBF_DBF5_POSITION                    equ 0005h
CWG1DBF_DBF5_SIZE                        equ 0001h
CWG1DBF_DBF5_LENGTH                      equ 0001h
CWG1DBF_DBF5_MASK                        equ 0020h
CWG1DBF_CWG1DBF_POSN                     equ 0000h
CWG1DBF_CWG1DBF_POSITION                 equ 0000h
CWG1DBF_CWG1DBF_SIZE                     equ 0006h
CWG1DBF_CWG1DBF_LENGTH                   equ 0006h
CWG1DBF_CWG1DBF_MASK                     equ 003Fh
CWG1DBF_CWG1DBF0_POSN                    equ 0000h
CWG1DBF_CWG1DBF0_POSITION                equ 0000h
CWG1DBF_CWG1DBF0_SIZE                    equ 0001h
CWG1DBF_CWG1DBF0_LENGTH                  equ 0001h
CWG1DBF_CWG1DBF0_MASK                    equ 0001h
CWG1DBF_CWG1DBF1_POSN                    equ 0001h
CWG1DBF_CWG1DBF1_POSITION                equ 0001h
CWG1DBF_CWG1DBF1_SIZE                    equ 0001h
CWG1DBF_CWG1DBF1_LENGTH                  equ 0001h
CWG1DBF_CWG1DBF1_MASK                    equ 0002h
CWG1DBF_CWG1DBF2_POSN                    equ 0002h
CWG1DBF_CWG1DBF2_POSITION                equ 0002h
CWG1DBF_CWG1DBF2_SIZE                    equ 0001h
CWG1DBF_CWG1DBF2_LENGTH                  equ 0001h
CWG1DBF_CWG1DBF2_MASK                    equ 0004h
CWG1DBF_CWG1DBF3_POSN                    equ 0003h
CWG1DBF_CWG1DBF3_POSITION                equ 0003h
CWG1DBF_CWG1DBF3_SIZE                    equ 0001h
CWG1DBF_CWG1DBF3_LENGTH                  equ 0001h
CWG1DBF_CWG1DBF3_MASK                    equ 0008h
CWG1DBF_CWG1DBF4_POSN                    equ 0004h
CWG1DBF_CWG1DBF4_POSITION                equ 0004h
CWG1DBF_CWG1DBF4_SIZE                    equ 0001h
CWG1DBF_CWG1DBF4_LENGTH                  equ 0001h
CWG1DBF_CWG1DBF4_MASK                    equ 0010h
CWG1DBF_CWG1DBF5_POSN                    equ 0005h
CWG1DBF_CWG1DBF5_POSITION                equ 0005h
CWG1DBF_CWG1DBF5_SIZE                    equ 0001h
CWG1DBF_CWG1DBF5_LENGTH                  equ 0001h
CWG1DBF_CWG1DBF5_MASK                    equ 0020h

